## Plan Result (prod-uksouth-enterprise)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;Richards-playground&#34;].azurerm_subscription.this
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-Sandbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["SDS-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
        name                       = "SDS-Sandbox"
      ~ subscription_ids           = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["Richards-playground"].azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "Richards-playground"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "Richards-playground"
      + tenant_id         = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Target":"prod-uksouth-enterprise","Vars":{}} -->